content/posts/Fate_of_a_mutation_in_a_fluctuating_environment_by_Cvijovic,_Good,_and_Desai_in_2015.md
+++
title = "Fate of a mutation in a fluctuating environment by Cvijovic, Good, and Desai in 2015"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:25-04:00
slug = "Fate_of_a_mutation_in_a_fluctuating_environment_by_Cvijovic,_Good,_and_Desai_in_2015"
draft = false
+++

## Model {#model}


### Fig. 1. Fitness and frequency trajectories. {#fig-dot-1-dot-fitness-and-frequency-trajectories-dot}


### We neglect longer-term changes in discrete environmental epochs (Fig. 1A). Through the bulk of selection pressures, so that s(t) will fluctuate between s1 and s2 in discrete environmental epochs {#we-neglect-longer-term-changes-in-discrete-environmental-epochs--fig-dot-1a--dot-through-the-bulk-of-selection-pressures-so-that-s--t--will-fluctuate-between-s1-and-s2-in-discrete-environmental-epochs}


### Timescales of environmental variation {#timescales-of-environmental-variation}


### An effective diffusion process {#an-effective-diffusion-process}


## Heuristic analysis {#heuristic-analysis}


### The reduced efficiency of selection {#the-reduced-efficiency-of-selection}


### The role of seasonal drift {#the-role-of-seasonal-drift}


## Formal analysis {#formal-analysis}


## Discussion {#discussion}


## Supplement {#supplement}


### The Effective Diffusion Regime {#the-effective-diffusion-regime}

<!--list-separator-->

-  Fast Switching [\\[s \tau \ll 1 \ll 2 \log(Ns)\\]]

<!--list-separator-->

-  Slow switching [\\[1 \ll \tau \ll 2 \log(Ns)\\]]

<!--list-separator-->

-  Unequal epochs (\\[\tau\_1 \neq \tau\_2\\])

<!--list-separator-->

-  Recurrent mutation (\\[N \mu \gg 1\\])


### Beyond the effective diffusion regime {#beyond-the-effective-diffusion-regime}

<!--list-separator-->

-  Fixation during the first epoch [\\[1 \ll 2 \log (Ns) \ll s \tau\\]]

<!--list-separator-->

-  Substantial average fitness effects ( \\[\bar{s} \tau \gtrsim 1\\])

<!--list-separator-->

-  Substantial variation in epoch lengths (\\[s \delta \tau \gg 1\\])


### Relation to previous work {#relation-to-previous-work}

<!--list-separator-->

-
